04_OpenFoam/_Tut_02/OpenFOAM-14/fluid/buoyantCavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

units [mm];

vertices
(
    ( 0     0  -260)
    (76     0  -260)
    (76  2180  -260)
    ( 0  2180  -260)
    ( 0     0   260)
    (76     0   260)
    (76  2180   260)
    ( 0  2180   260)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (35 150 15) simpleGrading (1 1 1)
);

boundary
(
    topAndBottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }

    hot
    {
        type wall;
        faces
        (
            (6 5 1 2)
        );
    }

    cold
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }
);

// ************************************************************************* //
